{
  "1984": "1988 (MCMLXXXVIII) was a leap year starting on Friday of the Gregorian calendar, the 1988th year of the Common Era (CE) and Anno Domini (AD) designations, the 988th  year of the 2nd millennium, the 88th  year of the 20th century, and the  9th   year of the 1980s decade.  \n1988 was a crucial year in the early history of the Internet—it was the year of the first well-known computer virus, the 1988 Internet worm. The first permanent intercontinental Internet link was made between the United States (National Science Foundation Network) and Europe (Nordunet) as well as the first Internet-based chat protocol, Internet Relay Chat.",
  "harry potter": "Harry Potter is a series of seven fantasy novels written by British author J. K. Rowling. The novels chronicle the lives of a young wizard, Harry Potter, and his friends, Ron Weasley and Hermione Granger, all of whom are students at Hogwarts School of Witchcraft and Wizardry. The main story arc concerns Harry's conflict with Lord Voldemort, a dark wizard who intends to become immortal, overthrow the wizard governing body known as the Ministry of Magic, and subjugate all wizards and Muggles.",
  "inception": "Inception is a 2010 science fiction action heist film written and directed by Christopher Nolan, who also produced it with Emma Thomas, his wife. The film stars Leonardo DiCaprio as a professional thief who steals information by infiltrating the subconscious of his targets. He is offered a chance to have his criminal history erased as payment for the implantation of another person's idea into a target's subconscious. The ensemble cast includes Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Elliot Page, Tom Hardy, Cillian Murphy, Tom Berenger, Dileep Rao, and Michael Caine.",
  "batman": "Batman is a superhero who appears in American comic books published by DC Comics. Batman was created by the artist Bob Kane and writer Bill Finger, and debuted in the 27th issue of the comic book Detective Comics on March 30, 1939. In the DC Universe, Batman is the alias of Bruce Wayne, a wealthy American playboy, philanthropist, and industrialist who resides in Gotham City. His origin story features him swearing vengeance against criminals after witnessing the murder of his parents, Thomas and Martha, as a child, a vendetta tempered by the ideal of justice. He trains himself physically and intellectually, crafts a bat-inspired persona, and monitors the Gotham streets at night. Kane, Finger, and other creators accompanied Batman with supporting characters, including his sidekicks Robin and Batgirl; allies Alfred Pennyworth and James Gordon; love interest and occasional adversary Catwoman; as well as foes such as the Penguin, the Riddler, Two-Face, and his archenemy, the Joker, among others.",
  "batman begins": "Batman Begins is a 2005 superhero film directed by Christopher Nolan, who co-wrote the screenplay with David S. Goyer. Based on the DC Comics character Batman, it stars Christian Bale as Bruce Wayne / Batman, with Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, and Morgan Freeman in supporting roles. The film reboots the Batman film series, telling the origin story of Bruce Wayne from the death of his parents to his journey to become Batman and his fight to stop Ra's al Ghul (Neeson) and the Scarecrow (Murphy) from plunging Gotham City into chaos.",
  "superman returns": "Superman Returns is a 2006 American superhero film directed by Bryan Singer, and written by Michael Dougherty and Dan Harris from a story by Singer, Dougherty and Harris, based on the DC Comics character Superman. It serves as a homage sequel to Superman (1978) and Superman II (1980), ignoring the events of Superman III (1983), Supergirl (1984), and Superman IV: The Quest for Peace (1987). The film stars Brandon Routh as Superman, Kate Bosworth as Lois Lane and Kevin Spacey as Lex Luthor, with James Marsden, Frank Langella, Eva Marie Saint and Parker Posey in supporting roles. In the film, Superman returns to Earth after five years and discovers that his love interest Lois Lane has moved on from him and that his archenemy Lex Luthor is planning to kill him and reshape North America."
}